Documents/бит_СправкаОСоставеСемьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СправкаОСоставеСемьи</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьОснованиеФлаг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПредъявления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодственныеОтношения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_СправкаОСоставеСемьи/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мКолЧел Экспорт;				// Хранит количество прописанных человек в семье по ЛС.
Перем мТаблицаФизЛиц Экспорт;		// Хранит таблицу физ лиц.
Перем мПолнаяТаблицаФизЛиц Экспорт;	// Хранит таблицу физ лиц когда-либо прописанных по ЛС.

// Перменные настроек ЖКХ.
Перем мПрефиксУлица                        Экспорт; // Хранит флаг настройки ЖКХ.
Перем мПрефиксДом                          Экспорт; // Хранит флаг настройки ЖКХ.
Перем мПрефиксКорпус                       Экспорт; // Хранит флаг настройки ЖКХ.
Перем мПрефиксКвартира                     Экспорт; // Хранит флаг настройки ЖКХ.

#КонецОбласти

#Если Клиент Тогда

#Область ЭкспортныеПроцедурыИФункцииДокумента
	
// Список прописанных по ЛС на ткущую дату.
// Параметры  НЕТ.
//
Процедура  СписокПроживающих(ВесьСписок = Ложь)  Экспорт
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		// В запросы введено поле Метка. 
		// Для  вывода в таб часть первым жильца, являющимся ответственным по ЛС.
		Если ВесьСписок Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо,
			|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК РодственныеОтношения,
				|	ВЫБОР
				|		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК Метка,
				|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
				|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
				|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания
				|ИЗ
				|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
				|
				|УПОРЯДОЧИТЬ ПО
				|	Метка";
				
			Иначе
				
				ТекстЗапроса =
				"ВЫБРАТЬ
				|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо,
				|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК РодственныеОтношения,
				|	ВЫБОР
				|		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК Метка,
				|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения
				|ИЗ
				|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
				|ГДЕ
				|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
				|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
				|
				|УПОРЯДОЧИТЬ ПО
			|	Метка";
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Дата"       , КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		
		Если ВесьСписок Тогда
			мПолнаяТаблицаФизЛиц 	= Запрос.Выполнить().Выгрузить();
			мКолЧел 		= мТаблицаФизЛиц.Количество();
		Иначе
			мТаблицаФизЛиц 	= Запрос.Выполнить().Выгрузить();
			мКолЧел 		= мТаблицаФизЛиц.Количество();
		КонецЕсли;
		
	Иначе
		мТаблицаФизЛиц 	= Неопределено;
		мКолЧел         = 0;
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСправкаОСоставеСемьи(Флаг = Истина) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,Дата);

	Запрос.УстановитьПараметр("ЛицевойСчет" ,ЛицевойСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправкаОСоставеСемьи.Номер,
	|	СправкаОСоставеСемьи.Дата,
	|	СправкаОСоставеСемьи.Организация,
	|	СправкаОСоставеСемьи.ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
	|	СправкаОСоставеСемьи.ДляПредъявления,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации
	|ИЗ
	|	Документ.бит_СправкаОСоставеСемьи КАК СправкаОСоставеСемьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СправкаОСоставеСемьи.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО СправкаОСоставеСемьи.ФизЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ГДЕ
	|	СправкаОСоставеСемьи.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ                              
	|	бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.РодственныеОтношения КАК РодственнаяСвязь,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.ДатаРождения,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ВЫБОР
	|		КОГДА (НЕ ФИОФизЛицСрезПоследних.Фамилия ЕСТЬ NULL )
	|			ТОГДА ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
	|		ИНАЧЕ бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо
	|	КОНЕЦ КАК ФИО,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.НомерСтроки
	|ИЗ
	|	Документ.бит_СправкаОСоставеСемьи.ФизическиеЛица КАК бит_СправкаОСоставеСемьиФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_СправкаОСоставеСемьиФизическиеЛица.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	ТабДокумент   = Новый ТабличныйДокумент();
	Если Флаг Тогда
		ТабДокумент.КлючПараметровПечати = "СправкаОСоставеСемьи";
		Макет         = ПолучитьМакет("СправкаОСоставеСемьи");
	Иначе
		ТабДокумент.КлючПараметровПечати = "СправкаОбОтсутствииПрописанных";
		Макет         = ПолучитьМакет("СправкаОбОтсутствииПрописанных");
	КонецЕсли;
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	ШапкаОбласть.Параметры.НомерСправки = Шапка.Номер;
	ШапкаОбласть.Параметры.ДатаВыдачи   = Формат(Шапка.Дата,"ДФ='dd.MM.yyyy ""г.""'");
	
	СтруктураДанных = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
	ШапкаОбласть.Параметры.Организация       = СтруктураДанных.НаименованиеДляПечатныхФорм;
	Если Флаг Тогда
		ШапкаОбласть.Параметры.ОрганизацияИННКПП = Строка(СтруктураДанных.ИНН)+"\"+Строка(СтруктураДанных.КПП);
		ШапкаОбласть.Параметры.Факс              = СтруктураДанных.Телефоны;
		ШапкаОбласть.Параметры.РС                = "№"+Строка(СтруктураДанных.НомерСчета)+", "+Строка(СтруктураДанных.Банк)+"\"+Строка(СтруктураДанных.КоррСчет)+"\"+Строка(СтруктураДанных.БИК);
	КонецЕсли;
	ШапкаОбласть.Параметры.АдресОрганизации  = СтруктураДанных.ФактическийАдрес;
	ШапкаОбласть.Параметры.Телефон           = СтруктураДанных.Телефоны;
	
	Если Шапка.ФизЛицо <> Неопределено Тогда
		Если Шапка.ФИО <> Null Тогда
			ФИО = Шапка.ФИО;
			
		Иначе
			ФИО = Шапка.ФизЛицо;
		КонецЕсли; 
		
		АдресПрибытия ="";
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		ДлинаАдреса_1 	= 32;

		ФИО_склон = "";
		ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(ФИО),3,Шапка.ФизЛицо.Пол,ФИО_склон);

		Если Флаг Тогда
			ШапкаОбласть.Параметры.ДатаРегистрации = ?(ЗначениеЗаполнено(Шапка.ДатаРегистрации), Формат(Шапка.ДатаРегистрации,"ДФ='dd.MM.yyyy ""г.""'"),"");
			
			ФИО_1 = "";
			ФИО_2 = "";

			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФИО_склон, 20, ФИО_1, ФИО_2);

			ШапкаОбласть.Параметры.ФИО_1 = ФИО_1;
			ШапкаОбласть.Параметры.ФИО_2 = ФИО_2;
			
			ШапкаОбласть.Параметры.ДД   = Шапка.ФизЛицо.ДатаРождения;
			ДатаМесяц 					= Формат(Шапка.ФизЛицо.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.ММ 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГГГГ = Шапка.ФизЛицо.ДатаРождения;
			
			АдресПрибытия = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(Шапка.ФизЛицо, "Юридический");
			Если НЕ ЗначениеЗаполнено(АдресПрибытия) Тогда
				АдресПрибытия =	ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира), ", кв. " + Строка(ЛицевойСчет.Квартира),"");
			КонецЕсли;
		Иначе
			
			ШапкаОбласть.Параметры.ФИО = ФИО;
			
			Если ЗначениеЗаполнено(ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
				
				АдресПрибытия = Строка(ЛицевойСчет.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира), "кв. " + ЛицевойСчет.Квартира,"");
				
			Иначе
				
				ДлинаАдреса_1 = 38;
				ОбновитьНастройкиЖКХ();                                                  
				Квартира = ?(ЗначениеЗаполнено(ЛицевойСчет.Квартира),", "+ мПрефиксКвартира + ЛицевойСчет.Квартира,"");		
				Адрес = "" + мПрефиксУлица + " " + ЛицевойСчет.УлицаЛицевогоСчета + ", " + мПрефиксДом + ЛицевойСчет.Здание +?(ЗначениеЗаполнено(ЛицевойСчет.Здание.Корпус),", "+ мПрефиксКорпус + ЛицевойСчет.Здание.Корпус, "") 
				+ Строка(Квартира);
				АдресПрибытия = Адрес;

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Полный адрес по ЛС " + ЛицевойСчет + " можно получить, заполнив почтовый адрес у здания");
				
			КонецЕсли;
		КонецЕсли; 
		
		Если  ЗначениеЗаполнено(АдресПрибытия) Тогда
			
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, ДлинаАдреса_1, АдресПрибытия_1 ,АдресПрибытия_2  );
			
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для вывода в бланк адреса заполните адрес прописки в справочнике ""Проживающие"" и/или почтовый адрес в справочнике ""Список зданий""");
			
		КонецЕсли;
		
		ШапкаОбласть.Параметры.АдресПрибытия_1 =  АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 =  АдресПрибытия_2;
		
	КонецЕсли; 
	
	Если Флаг Тогда
		Если ЗначениеЗаполнено(мКолЧел) Тогда
			ШапкаОбласть.Параметры.КолЧел          = мКолЧел ;
		Иначе
			ШапкаОбласть.Параметры.КолЧел          = Выборка.Количество();
		КонецЕсли; 
		
	Иначе	
		Если мКолЧел <> Неопределено Тогда
			Если мКолЧел > 0 Тогда
				ШапкаОбласть.Параметры.Собственник = "Собственник - ";
				Если мКолЧел = 1 Тогда
					ШапкаОбласть.Параметры.Регистрированные = "зарегистрирован "+ Строка(мКолЧел) + " чел.";
				Иначе
					ШапкаОбласть.Параметры.Регистрированные = "зарегистрировано "+ Строка(мКолЧел) + " чел.";
				КонецЕсли; 
			Иначе  	
				ШапкаОбласть.Параметры.Регистрированные = "никто не зарегистрирован.";
				ШапкаОбласть.Параметры.Собственник = "Собственник без регистрации - ";
				
			КонецЕсли;
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Справка выведена не полностью! Переформируйте табличную часть документа кнопкой ""Заполнить"".");
			
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Если Флаг Тогда
		Если Выборка.Количество()>0  Тогда
			
			ШапкаСтрокОбласть  = Макет.ПолучитьОбласть("ШапкаСтрок");
			ТабДокумент.Вывести(ШапкаСтрокОбласть);
			
			ДанныеСтрока = Макет.ПолучитьОбласть("ДанныеСтрока");
			Пока Выборка.Следующий()Цикл
				ДанныеСтрока.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ДанныеСтрока);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОтветственныеЛица = бит_ОбщегоНазначения.бит_ОтветственныеЛица(Организация, Дата);
	Подвал.Параметры.ДляПредъявления  = Шапка.ДляПредъявления;
	Если Флаг Тогда
		Подвал.Параметры.Руководитель     = ОтветственныеЛица.РуководительПредставление;
		Подвал.Параметры.ДатаФормирования = Дата;
	КонецЕсли;
	Подвал.Параметры.Паспортист       = ОтветственныеЛица.ПаспортистПредставление;
	ТабДокумент.Вывести(Подвал);
	Возврат ТабДокумент;
	
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "СправкаОСоставеСемьи" тогда
		
		ТабДокумент = ПечатьСправкаОСоставеСемьи();
	ИначеЕсли ИмяМакета = "СправкаОбОтсутствииПрописанных" Тогда
		// Справка об отсутствии зарегистрированных по  ЛС выдается. 
		// ТОЛЬКО собственнику жилья.
		// Получить полный список когда-либо проживающих по ЛС.
		СписокПроживающих(Истина);
		
		НайденнаяСтрока = мПолнаяТаблицаФизЛиц.Найти(ФизЛицо, "ФизическоеЛицо");
		Если НайденнаяСтрока = Неопределено Тогда
			Если ЗначениеЗаполнено(ФизЛицо) Тогда
				Если ЗначениеЗаполнено(ФизЛицо.Пол)Тогда
					
					Если ФизЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
						Текст = Строка(ФизЛицо) + " никогда не была зарегистрирована по ЛС " + Строка(ЛицевойСчет);
					Иначе
						Текст = Строка(ФизЛицо) + " никогда не был зарегистрирован по ЛС " + Строка(ЛицевойСчет);
					КонецЕсли;
					
				Иначе
					Текст = Строка(ФизЛицо) + " никогда не был(а) зарегистрирован(а) по ЛС " + Строка(ЛицевойСчет);
				КонецЕсли;
				
			Иначе
				Текст = "Заполните реквизит ""Физ. лицо"""  ;
			КонецЕсли; 
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
			
		ИначеЕсли НЕ НайденнаяСтрока.ВладелецКвартиры = Перечисления.ДаНет.Да	Тогда
			Текст = Строка(ФизЛицо) + " никогда не был(а) зарегистрирован(а) как собственник по ЛС " + Строка(ЛицевойСчет);

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
			
		Иначе
			ТабДокумент = ПечатьСправкаОСоставеСемьи(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(ТабДокумент, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_СправкаОСоставеСемьи"
	,"СправкаОСоставеСемьи"
	,"Ф6:Свидетельство о регистрации по месту проживания"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание)
	
	// Заполним реквизиты из стандартного набора по документу основанию.
	Если ТипЗнч(Основание) <> Тип("Структура") И Основание <> Неопределено Тогда
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		#Если Клиент Тогда
			Дата = РабочаяДата;
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЛицевойСчет) = Тип ("СправочникСсылка.бит_ЛицевыеСчета") Тогда
		СписокЛицевыхСчетов = "" + ЛицевойСчет;
	Иначе	
		СписокЛицевыхСчетов = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	// Добавление справки об отсутствующих.
	Возврат Новый Структура("СправкаОСоставеСемьи, СправкаОбОтсутствииПрописанных","Справка о составе семьи", "Справка об отсутствии прописанных");
	
КонецФункции

// Получает пррефиксы адреса из Настроек ЖКХ.
Процедура ОбновитьНастройкиЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ПрефиксУлица"                       , "");
	ПараметрыЖКХ.Вставить("ПрефиксДом"                         , "");
	ПараметрыЖКХ.Вставить("ПрефиксКорпус"                      , "");
	ПараметрыЖКХ.Вставить("ПрефиксКвартира"                    , "");
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(ТекущаяДата(), Организация, ПараметрыЖКХ);
	
	мПрефиксУлица                        = ПараметрыЖКХ.ПрефиксУлица;
	мПрефиксДом                          = ПараметрыЖКХ.ПрефиксДом;
	мПрефиксКорпус                       = ПараметрыЖКХ.ПрефиксКорпус;
	мПрефиксКвартира                     = ПараметрыЖКХ.ПрефиксКвартира;
	
КонецПроцедуры

#КонецОбласти
